app/Http/Controllers/AboutController.php

select `body` from `abouts`
---
    public function about() {
        $about = About::get('body')->first();

select `email`, `whatsapp` from `abouts`
---
    public function contact() {
        return view('contact', [
            'contact' => About::get(['email', 'whatsapp'])->first(),
            'webTitle' => 'Hubungi kami'
        ]);