app/Http/Controllers/ArticleController.php

select * from `articles` order by `created_at` desc
---
    public function index() {
        $data = Article::latest()->get();

select * from `articles` where `id` != 18 limit 4
---
    public function read(Article $article) {
        $new_articles = Article::where('id', '!=', $article->id)->limit(4)->get();