app/Http/Controllers/PregnancyAlertController.php

select * from `age_pregnancies` where `age_pregnancies`.`user_id` = 1 and `age_pregnancies`.`user_id` is not null limit 1
select * from `pregnancy_alerts` where `weeks` = 13
---
    public function index() {
        $user = Auth::user();
        $age_pregnancy = $user->age_pregnancy;
        $age = $age_pregnancy ? get_age_of_pregnancy($age_pregnancy->pregnancy_start) : NULL;

        $idStatuses = PregnancyStatus::where('user_id', $user->id)->get('pregnancy_alert_id');

        return view('pregnancy.index', [
            'age' => $age,
            'pregnancy_alerts' => PregnancyAlert::where('weeks', $age)->get(),
            'pregnancy_alerts_before' => $age_pregnancy ? PregnancyAlert::where('weeks', '>=', $age_pregnancy->age_when_join)->where('weeks', '<' , $age)->whereNotIn('id', $idStatuses->toArray())->get() : [],
            'user' => $user,
            'webTitle' => 'Pengingat Kesehatan'
        ]);