app/Http/Controllers/QuestionController.php

select * from `questions`
---
    public function quiz() {
        $questions = Question::all();

select * from `questions`
---
    public function evaluation() {
        $questions = Question::all();