app/Models/User.php

    public function isAlreadyFilledOutQuiz() {
        return $this->answers()->where('type', 'quiz')->count() ? true : false;
---
select count(*) as aggregate from `answers` where `answers`.`user_id` = 1 and `answers`.`user_id` is not null and `type` = 'evaluation'