app/Http/Controllers/admin/ArticleController.php

    public function index() {
        return view('admin.articles.index', [
            'articles'  => Article::latest()->paginate(9)
        ]);
---
select * from `articles` order by `created_at` desc limit 9 offset 0
select count(*) as aggregate from `articles`