app/Http/Controllers/admin/QuestionController.php

select * from `users` limit 1
---
    public function evaluation() {
        $users = User::whereHas('answers', function(Builder $query) {
            $query->where('type', 'evaluation');
        })->get();

select * from `users` where `users`.`id` = '1' limit 1
select * from `answers` where `user_id` = '1' and `type` = 'quiz'
select * from `offered_answers` where `offered_answers`.`id` in (11, 18, 24, 26, 36, 41)
select * from `questions` where `questions`.`id` in (4, 5, 6, 7, 8, 9)
---
    public function quiz_show($user_id) {
        $user = User::find($user_id)->first();
        $answers = Answer::where('user_id', $user_id)->where('type', 'quiz')->with('question', 'offered_answer');

        $true_answer = DB::select("select answers.id, point from answers inner join questions on answers.question_id = questions.id where answers.offered_answer_id = questions.true_answer AND questions.true_answer IS NOT NULL AND answers.user_id = $user_id AND answers.type = 'quiz'");
        $false_answer = DB::select("select answers.id, point from answers inner join questions on answers.question_id = questions.id where answers.offered_answer_id != questions.true_answer AND questions.true_answer IS NOT NULL AND answers.user_id = $user_id AND answers.type = 'quiz'");

        $true_point = $this->getTotalPoint($true_answer);
        $false_point = $this->getTotalPoint($false_answer);

        return view('admin.questions.show_answers', [
            'user' => $user,
            'answers' => $answers->get(),

select * from `users` where `users`.`id` = '1' limit 1
select * from `answers` where `user_id` = '1' and `type` = 'evaluation'
---
    public function evaluation_show($user_id) {
        $user = User::find($user_id)->first();
        $answers = Answer::where('user_id', $user_id)->where('type', 'evaluation');

        $true_answer = DB::select("select answers.id, point from answers inner join questions on answers.question_id = questions.id where answers.offered_answer_id = questions.true_answer AND questions.true_answer IS NOT NULL AND answers.user_id = $user_id AND answers.type = 'evaluation'");
        $false_answer = DB::select("select answers.id, point from answers inner join questions on answers.question_id = questions.id where answers.offered_answer_id != questions.true_answer AND questions.true_answer IS NOT NULL AND answers.user_id = $user_id AND answers.type = 'evaluation'");

        $true_point = $this->getTotalPoint($true_answer);
        $false_point = $this->getTotalPoint($false_answer);

        return view('admin.questions.show_answers', [
            'user' => $user,
            'answers' => $answers->get(),